app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Hello.\r\n"], ["post_id", 2], ["created_at", "2015-05-01 01:05:08.106690"], ["updated_at", "2015-05-01 01:05:08.106690"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 3], ["updated_at", "2015-05-01 01:05:19.333872"], ["id", 2]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
    current_user.comments << @comment

    if @comment.save