app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "link", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "First post"], ["link", "Link to my post"], ["user_id", 1], ["created_at", "2015-04-29 02:41:47.743633"], ["updated_at", "2015-04-29 02:41:47.743633"]]
---
  def create
    @post = current_user.posts.create(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @vote = Vote.new
    @comment = Comment.new
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
---
  def edit
    @post = current_user.posts.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
---
  def update
    @post = current_user.posts.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    @post = current_user.posts.find(params[:id])
    @post.destroy