app/controllers/votes_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "votes" ("value", "votable_id", "votable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["value", -1], ["votable_id", 2], ["votable_type", "Post"], ["created_at", "2015-04-30 21:55:39.466219"], ["updated_at", "2015-04-30 21:55:39.466219"]]
---
  def create
    if params.key? :comment_id
      votable = Comment.find(params[:comment_id])
      @post = Post.find(params[:post_id])
      return_page = @post
    elsif params.key? :post_id
      votable = Post.find(params[:post_id])
      return_page = :posts
    elsif params.key? :user_id
      votable = User.find(params[:user_id])
      return_page = :users
    else
      return render plain: "Invalid input. Stop it!"
    end

    @vote = votable.votes.find_by_user_id(current_user.id)

    if @vote.nil?
      @vote = votable.votes.create(vote_params)

UPDATE "votes" SET "user_id" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["user_id", 1], ["updated_at", "2015-04-30 22:18:24.638304"], ["id", 8]]
---
      end
    end

    if @vote.present? && @vote.save